src/dind.org
:PROPERTIES:
:ID:       477fec3d-e950-4b45-aeca-f878e1032fe4
:END:
#+TITLE: Docker inside containers
#+LANGUAGE: en
#+PROPERTY: header-args:python :tangle lib/dind.py
#+PROPERTY: header-args:bash   :tangle no :dir (expand-file-name ".." default-directory) :results verbatim :cache yes

Some CI pipelines and integration tests need to build or run Docker
images. I need a way to run Docker inside a Dagger container (DinD),
handling cgroup setup, tmpfs mounts, and dockerd lifecycle.

When running Docker-in-Docker inside a Dagger container, there is a
DNS subnet collision to handle. The outer Dagger engine places the
container on a =10.87.0.0/16= network with a DNS server at
=10.87.0.1=.  When a nested Dagger engine starts inside the DinD
container, it creates its own =dagger0= bridge in the same
=10.87.0.0/16= range.  That route captures all traffic to
=10.87.0.1=, making the DNS server unreachable from containers managed
by the inner engine.

The fix: before starting =dockerd=, save the current DNS server and
tell Docker (via =daemon.json=) to hand out =172.17.0.1= (the Docker
bridge gateway) as the DNS server for containers.  After =dockerd=
creates the bridge, add iptables DNAT rules that forward DNS queries
arriving at =172.17.0.1:53= to the real DNS server.  Containers
managed by the inner Docker — including a nested Dagger engine — can
always reach the bridge gateway, so DNS works transparently.

#+begin_src python
import dagger
from dagger import dag, function


_CGROUP_SETUP = (
    "mount -t cgroup2 cgroup2 /sys/fs/cgroup 2>/dev/null || true\n"
    "mkdir -p /sys/fs/cgroup/init\n"
    "xargs -rn1 < /sys/fs/cgroup/cgroup.procs > /sys/fs/cgroup/init/cgroup.procs 2>/dev/null || true\n"
    "sed -e 's/ / +/g' -e 's/^/+/' < /sys/fs/cgroup/cgroup.controllers"
    " > /sys/fs/cgroup/cgroup.subtree_control 2>/dev/null || true\n"
)

_DNS_SETUP = (
    "DNS_SERVER=$(awk '/^nameserver/{print $2; exit}' /etc/resolv.conf)\n"
    "mkdir -p /etc/docker\n"
    'echo \'{"dns": ["172.17.0.1"]}\' > /etc/docker/daemon.json\n'
)

_DOCKERD_START = (
    "mkdir -p /var/lib/docker\n"
    "mount -t tmpfs tmpfs /var/lib/docker\n"
    "dockerd &>/var/log/dockerd.log &\n"
    "for i in $(seq 1 30); do docker info &>/dev/null && break; sleep 0.2; done\n"
    "iptables -t nat -A PREROUTING -p udp -d 172.17.0.1 --dport 53"
    " -j DNAT --to-destination $DNS_SERVER:53\n"
    "iptables -t nat -A PREROUTING -p tcp -d 172.17.0.1 --dport 53"
    " -j DNAT --to-destination $DNS_SERVER:53\n"
)
#+end_src

* Installing Docker from the official repository

  This script adds the Docker APT repository and installs Docker CE.
  It is tangled to a standalone shell file so the Python code can
  inject it into the container as-is.

  #+begin_src sh :tangle lib/docker-repo-install.sh :tangle-mode (identity #o755)
#!/bin/sh
set -eu
. /etc/os-release
install -m 0755 -d /etc/apt/keyrings
curl -fsSL "https://download.docker.com/linux/$ID/gpg" \
    -o /etc/apt/keyrings/docker.asc
chmod a+r /etc/apt/keyrings/docker.asc
echo "deb [arch=$(dpkg --print-architecture) \
  signed-by=/etc/apt/keyrings/docker.asc] \
  https://download.docker.com/linux/$ID \
  $VERSION_CODENAME stable" \
    > /etc/apt/sources.list.d/docker.list
apt-get update
apt-get install --yes docker-ce docker-ce-cli containerd.io
  #+end_src

* Preparing a DinD-capable container
  :PROPERTIES:
  :ID:       03b5bc42-932d-49f9-b922-ee7cba52528a
  :END:

  Docker needs to be installed in the container first. This target handles
  adding the Docker APT repository and installing Docker CE.

  #+begin_src python
  @function
  def dind_container(
      self,
      base: dagger.Container | None = None,
      src: dagger.Directory | None = None,
  ) -> dagger.Container:
      """Return a container with Docker installed, ready for DinD.

      If base is provided, Docker is installed into it (must be Debian/Ubuntu-based).
      Otherwise uses the image from Lib.dind_ubuntu_image.
      src is the module source directory; defaults to the current directory.
      """
      if base is None:
          base = dag.container().from_(self.dind_ubuntu_image)
      if src is None:
          src = dag.current_module().source()

      return (
          base
          .with_exec(["apt-get", "update"])
          .with_exec([
              "apt-get", "install", "--yes",
              "ca-certificates", "curl", "gnupg", "iptables",
          ])
          .with_file(
              "/tmp/docker-repo-install.sh",
              src.file("src/lib/docker-repo-install.sh"),
          )
          .with_exec(["sh", "/tmp/docker-repo-install.sh"])
      )
  #+end_src

* Running commands with dockerd
  :PROPERTIES:
  :ID:       a02a8270-5268-4bb9-bcbc-56ebb5d5dfd5
  :END:

  Once Docker is installed, I need a way to start dockerd and run commands
  that talk to it. This handles cgroup v2 setup, a tmpfs for
  =/var/lib/docker=, and the dockerd lifecycle.

  [[https://docs.dagger.io/api/reference#definition-Container][insecure_root_capabilities=True]] tells Dagger to run the command with
  elevated privileges — the container gets the Linux capabilities
  normally stripped for safety (mounting filesystems, managing cgroups,
  etc.). Without this, =dockerd= cannot start because it needs to mount
  =tmpfs= and manipulate cgroups.

  #+begin_src python
  @function
  def dind_with_docker(
      self,
      cmd: str,
      ctr: dagger.Container | None = None,
  ) -> dagger.Container:
      """Run a shell command inside the container with dockerd available.

      Handles cgroup v2 setup, tmpfs for /var/lib/docker,
      and dockerd lifecycle. If no container is provided, uses dind_container().
      Runs with insecure_root_capabilities.
      """
      if ctr is None:
          ctr = self.dind_container()
      shell_cmd = _DNS_SETUP + _CGROUP_SETUP + _DOCKERD_START + cmd
      return ctr.with_exec(
          ["bash", "-c", shell_cmd],
          insecure_root_capabilities=True,
      )
  #+end_src

* Running the test suite inside DinD

  Dogfooding: build a container that has everything needed to run the
  project tests (Python, pytest, Dagger CLI) on top of the DinD base,
  then execute =./test.sh= with dockerd available.

  #+begin_src python
  @function
  def dind_run_tests(
      self,
      src: dagger.Directory | None = None,
  ) -> dagger.Container:
      """Run the project test suite inside Docker-in-Docker (dogfooding).

      Builds a test-ready container from the DinD base, installs Python,
      pytest, and the Dagger CLI, mounts the project source, and runs
      ./test.sh with dockerd available.
      """
      if src is None:
          src = dag.current_module().source()

      ctr = self.dind_container(src=src)
      ctr = (
          ctr
          .with_exec([
              "apt-get", "install", "--yes",
              "python3", "python3-pip", "python3-venv",
          ])
          .with_exec([
              "pip3", "install", "--break-system-packages",
              "pytest", "pytest-asyncio",
          ])
          .with_exec([
              "bash", "-c",
              "curl -fsSL https://dl.dagger.io/dagger/install.sh"
              " | BIN_DIR=/usr/local/bin sh",
          ])
          .with_directory("/work", src)
          .with_workdir("/work")
      )
      cmd = (
          "echo '=== dockerd ready ===' && "
          "docker info --format 'Docker: {{.ServerVersion}}' && "
          "echo '=== running test suite ===' && "
          "./test.sh"
      )
      return self.dind_with_docker(cmd=cmd, ctr=ctr)
  #+end_src

  #+NAME: dind_docker_info
  #+begin_src bash :tangle (daggerlib-tangle-test "dind_docker_info") :comments no :padline no
  dagger call dind-with-docker --cmd="docker info --format '{{.OSType}}'" stdout
  #+end_src

  #+RESULTS[289f9477730f7e02d810eeab0ac9f5576bdf7c75]: dind_docker_info
  : linux

  #+BEGIN_SRC org :tangle (daggerlib-tangle-expected "dind_docker_info") :noweb yes :exports none :comments no :padline no
  <<dind_docker_info()>>
  #+END_SRC
